<!DOCTYPE html>
<html>
<head>
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no">
    <meta name="product" content="Metro UI CSS Framework">
    <meta name="description" content="Simple responsive css framework">
    <meta name="author" content="Sergey S. Pimenov, Ukraine, Kiev">
    <meta name="keywords" content="js, css, metro, framework, windows 8, metro ui">

    <link href="css/metro-bootstrap.css" rel="stylesheet">
    <link href="css/metro-bootstrap-responsive.css" rel="stylesheet">
    <link href="css/iconFont.css" rel="stylesheet">
    <link href="css/docs.css" rel="stylesheet">
    <link href="js/prettify/prettify.css" rel="stylesheet">

    <!-- Load JavaScript Libraries -->
    <script src="js/jquery/jquery.min.js"></script>
    <script src="js/jquery/jquery.widget.min.js"></script>
    <script src="js/jquery/jquery.mousewheel.js"></script>
    <script src="js/prettify/prettify.js"></script>

    <!-- Metro UI CSS JavaScript plugins -->
    <script src="js/load-metro.js"></script>

    <!-- Local JavaScript -->
    <script src="js/docs.js"></script>
    <script src="js/github.info.js"></script>

    <title>LOSM: Linked Open Street Map [beta version]</title>

    <style>
    </style>
</head>
<body class="metro" style="background-color: #fdfbfb;">
    <!-- <header class="bg-dark" data-load="header.html"></header>-->

    <div class="">
        <div style="background: url(images/21454.jpg) top left no-repeat; background-size: cover; height: 400px;">
            <div class="container" style="padding: 50px 20px">
                <h1 class="fg-white"><a href="index2.html" style="color:#fff">LOSM: Linked Open Street Map <sup>beta version</sup></a></h1>
                <h2 class="fg-white">
                    A new service to query OpenstreetMap<br /> through a clear Sparql endpoint.
                </h2>

    <!--            <a href="https://github.com/olton/Metro-UI-CSS/archive/master.zip"
                   class="place-left button bg-darkRed bg-hover-red fg-white fg-hover-white bd-orange" style="margin-top: 10px">
                    <h3 style="margin: 10px 40px">Download <span class="icon-download-2 on-right"></span></h3>-->
                </a>
            </div>
        </div>

        <div class="container">
            <div class="grid fluid">
                <div class="row">
                    <div class="span4  padding20 text-center" style="background-color:#26a;">
                        <h2 class="fg-white"><a href="index2.html" style="color:#fff">easy to use</a></h2>
                    </div>
                    <div class="span4 bg-lighterBlue padding20 text-center">
                        <h2 class="fg-white"><a href="demo.html" style="color:#fff"><strong>Try it Now!</strong></a></h2>
                    </div>
                    <div class="span4  padding20 text-center"  style="background-color:#26a;">
                        <h2 class="fg-white"><a href="contacts.html" style="color:#fff">contacts</a></h2>
                    </div>
                </div>
            </div>
        </div>

        <div class="container">
            <div class="grid no-margin">
                <div class="row">
                    <div class="span4 no-tablet-portrait no-phone">
                        <div class="notice marker-on-right  padding20 text-center" style="height: 200px;background-color:#26a;">
                            <h1 class="fg-white" style="font-size: 120px; line-height: 80px; margin-bottom: 30px">5</h1>
                            <p class="subheader-secondary fg-white">simple points to achieve</p>
                        </div>
                    </div>
                    <div class="span8">
                        <div class="notice marker-on-bottom no-desktop padding10 bg-lighterBlue text-center ">
                            <p class="subheader-secondary fg-white no-margin">simple points to achieve</p>
                        </div>
                        <ol class="styled">
                            <li style="width: 90%">Query data with <strong>SPARQL</strong> and <strong>LinkedGeoData</strong></li>
                            <li style="width: 90%">Include <strong>the full updated OpenStreetMap Dataset</strong></li>
                            <li style="width: 90%">An update <strong>every 15 minutes</strong></li>
                            <li style="width: 100%">Create queries with <strong><a href="https://jena.apache.org/documentation/query/spatial-query.html" target=_blank >Jena spatial</a></strong> and <strong><a href="https://jena.apache.org/documentation/query/spatial-query.html" target=_blank >WKT literals</a></strong> </li>
                            <li style="width: 100%">Online translation from SPARQL to <strong><a href="http://overpass-turbo.eu/" target=_blank >Overpass Turbo</a></strong></li>
                        </ol>
                    </div>
                </div>
            </div>



<pre class="prettyprint linenums no-phone" style="margin-top: 10px;">
Some queries you can execute with LOSM Sparql endpoint

#Obtain OSM URI, latitude and longitude of nodes named "London"
SELECT ?link ?lat ?lon
WHERE  {  
   ?link rdfs:label "London" .  
   ?link geo:lat ?lat .
   ?link geo:long ?lon.

}

 #Obtain OSM URI and name of nodes in the nearby of the city center of London (limit expressed in meters)  
SELECT ?object ?name 
WHERE  {  
   ?link rdfs:label "London" .  
   ?link geo:lat ?lat .
   ?link geo:long ?lon.

   ?object spatial:nearby(?lat ?lon 100 'm') . 

   ?object rdfs:label ?name. 
}

 #Obtain OSM URI and name of nodes in the nearby of the city center of London (limit expressed in kilometers)  
SELECT ?object ?name 
WHERE  {  
   ?link rdfs:label "London" .  
   ?link geo:lat ?lat .
   ?link geo:long ?lon.

   ?object spatial:nearby(?lat ?lon 100 'mi') . 

   ?object rdfs:label ?name. 
}

#Obtain OSM URI and name of nodes in the nearby of the city center of London (limit expressed in miles)  
SELECT ?object ?name 
WHERE  {  
   ?link rdfs:label "London" .  
   ?link geo:lat ?lat .
   ?link geo:long ?lon.

   ?object spatial:nearby(?lat ?lon 100 'km') . 

   ?object rdfs:label ?name. 
}

#Results filtering by LinkedGeoData classes corresponding to Open Street Map tags 
SELECT ?object ?name 
WHERE  {  
   ?link rdfs:label "London" .  
   ?link geo:lat ?lat .
   ?link geo:long ?lon.

   ?object spatial:nearby(?lat ?lon 100 'm') . 

   ?object a lgdo:DrinkingWater. 
}

#Results filtering by LinkedGeoData classes and properties 
SELECT ?object ?name 
WHERE  {  
   ?link rdfs:label "London" .  
   ?link geo:lat ?lat .
   ?link geo:long ?lon.

   ?object spatial:nearby(?lat ?lon 100 'm') . 

   ?object lgdo:HighwayThing lgdo:BusStop. 
}


 #Results filtering by LinkedGeoData classes corresponding to Open Street Map keys 
SELECT ?object ?name 
WHERE  {  
   ?link rdfs:label "London" .  
   ?link geo:lat ?lat .
   ?link geo:long ?lon.

   ?object spatial:nearby(?lat ?lon 100 'm') . 

   ?object a lgdo:Amenity. 
}


 #Connected elements
SELECT ?object ?name 
WHERE  {  
   ?link rdfs:label "Bari" .  
   ?link geo:lat ?lat .
   ?link geo:long ?lon.

   ?object spatial:nearby(?lat ?lon 1000 'm') . 

   ?object a lgdo:DrinkingWater . 
   ?object geo:lat ?lat2 .
   ?object geo:long ?lon2.
   
   ?cinema spatial:nearby(?lat2 ?lon2 200 'm') . 

   ?cinema a lgdo:Cinema .
}

#Using  spatial:withinCircle
SELECT ?object ?name 
WHERE  {  
   ?link rdfs:label "London" .  
   ?link geo:lat ?lat .
   ?link geo:long ?lon.

   ?object spatial:withinCircle(?lat ?lon 100 'm') . 

   ?object a lgdo:Amenity. 
}


 #Using  spatial:withinBox
SELECT ?object ?name 
WHERE  {  

   ?object spatial:withinBox(50.746 7.157 50.748 7.154) . 

   ?object rdfs:label ?name .   
}


#Using spatial:within together with a WKT (POLYGON in this case)
SELECT ?object ?name 
WHERE  {  
?object spatial:within("POLYGON((50.746 7.157,50.746 7.154,50.748 7.154,50.748 7.157))") .
?object rdfs:label ?name
}
</pre>
        </div>

    </div>

    <script src="js/hitua.js"></script>

</body>
</html>
